[
    {
        "name": "Balu P",
        "title": "Senior Software Engineer",
        "mobile": "+91 7760221891",
        "email": "balu.p.sky@gmail.com",
        "linkedIn": "https://www.linkedin.com/in/balu-p-67b217157/",
        "linkedInlabel": "linkedin/balu-p",
        "location": "",
        "summary": {
            "title": "Summary",
            "description": "Innovative Senior Software Engineer with 7+ years of experience in developing robust, user-friendly applications. Proficient in modern web technologies and frameworks, with a strong focus on performance optimization and scalability. Passionate about delivering high-quality software solutions that enhance user experience and efficiency."
        },
        "skills": {
            "title": "Skills",
            "language": [
                "Angular",
                "C",
                "C++",
                "Java",
                "HTML",
                "TypeScript",
                "JavaScript",
                "Node.js",
                "Progress 4GL",
                "Python"
            ],
            "tools": [
                "GitHub",
                "PrimeNg",
                "Jira",
                "Jenkins",
                "SourceTree"
            ]
        },
        "workExperience": {
            "title": "Work Experience",
            "experience": [
                {
                    "company": "eProductivity Software",
                    "role": "Senior Software Engineer",
                    "duration": "2023 - Present",
                    "location": "Bangalore, India",
                    "description": [
                        "Led the development and modernization of a web application, enhancing user engagement and system efficiency.",
                        "Assessed UX/UI designs for technical feasibility, improving user satisfaction and interface usability.",
                        "Developed new UI components in Angular, adhering to quality standards and reducing development time.",
                        "Refactored code for better efficiency and performance, resulting in increased application speed and reliability.",
                        "Mentored junior UI developers, providing coaching on product features and technologies, boosting team productivity."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Software Engineer",
                    "duration": "2021 - 2023",
                    "location": "Bangalore, India",
                    "description": [
                        "Developed full-stack software applications tailored to user requirements, ensuring functionality and scalability.",
                        "Resolved customer issues by understanding their needs and delivering effective solutions.",
                        "Collaborated within a Scrum framework, contributing to a streamlined development process and shared team goals.",
                        "Maintained high code quality by following coding standards and utilizing test-driven development, pair programming, and other best practices.",
                        "Refactored code to enhance performance and reduce complexity while maintaining unit tests to ensure reliability."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Associate Software Engineer",
                    "duration": "2018 - 2021",
                    "location": "Bangalore, India",
                    "description": [
                        "Independently developed and managed new functional modules, contributing to the software's growth and enhancement.",
                        "Proactively tackled longstanding backlog issues by delivering quick, effective solutions while deepening expertise in the software’s functional architecture.",
                        "Served as the primary point of contact for issue resolution during regression testing, leveraging strong problem-solving skills and efficient code development."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Intern",
                    "duration": "01/2018 - 06/2018",
                    "location": "Bangalore, India",
                    "description": [
                        "Received hands-on training on the company’s software product, its features, and market applications.",
                        "Gained expertise in Progress 4GL, the core technology used in the software development process.",
                        "Proactively identified and resolved existing software bugs during the regression cycle while gathering new requirements for early-stage development.",
                        "Excelled in training and demonstrated strong performance in developing new requirements."
                    ]
                }
            ]
        },
        "awards": {
            "title": "Honor & Awards",
            "content": [
                {
                    "title": "Hackathon Winner",
                    "company": "eProductivity Software",
                    "year": "2025"
                },
                {
                    "title": "Doubles Badminton Champion",
                    "company": "eProductivity Software",
                    "year": "2024"
                },
                {
                    "title": "Best Performer of the Year",
                    "company": "eProductivity Software",
                    "year": "2023"
                },
                {
                    "title": "Best Team of the Company",
                    "company": "Electronics For Imaging",
                    "year": "2022"
                }
            ]
        },
        "education": {
            "title": "Education",
            "content": [
                {
                    "degree": "BE in Computer Science",
                    "institute": "PES Institute of Technology",
                    "duration": "2014 - 2018",
                    "location": "Bangalore, India"
                }
            ]
        }
    }
]