[
    {
        "name": "Balu P",
        "title": "Senior Software Engineer",
        "mobile": "+91 7760221891",
        "email": "balu.p.sky@gmail.com",
        "linkedIn": "https://www.linkedin.com/in/balu-p-67b217157/",
        "linkedInlabel": "linkedin/balu-p",
        "location": "",
        "summary": {
            "title": "Summary",
            "description": "Innovative Senior Software Engineer with over 7 years of experience at ePS, specializing in building robust, user-friendly applications. Skilled in modern web technologies and frameworks, I aim to enhance ePS's software solutions with a focus on performance and scalability. Successfully optimized code, improving user experience."
        },
        "skills": {
            "title": "Skills",
            "language": [
                "Angular",
                "C",
                "C++",
                "Java",
                "HTML",
                "TypeScript",
                "JavaScript",
                "Node.js",
                "Progress 4GL",
                "Python"
            ],
            "tools": [
                "GitHub",
                "PrimeNg",
                "Jira",
                "Jenkins",
                "SourceTree"
            ]
        },
        "workExperience": {
            "title": "Work Experience",
            "experience": [
                {
                    "company": "eProductivity Software",
                    "role": "Senior Software Engineer",
                    "duration": "2023 - Present",
                    "location": "Bangalore, India",
                    "description": [
                        "Led the development and implementation of a modernized web application, enhancing user engagement and increasing system efficiency.",
                        "Evaluated UX and UI designs for technical feasibility, resulting improvement in user satisfaction and interface usability.",
                        "Built new UI components in Angular, ensuring quality standards and fulfilling requirements, which reduced development time.",
                        "Refactored code to enhance efficiency and performance, leading to increased application speed and reliability.",
                        "Onboarded junior UI developers by providing coaching on product features and technologies, improving team productivity."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Software Engineer",
                    "duration": "2021 - 2023",
                    "location": "Bangalore, India",
                    "description": [
                        "Working as a full-stack developer to create software applications that fulfill user requirements.",
                        "Resolving customer issues by understanding their concerns or new requirements and providing solutions that satisfy them.",
                        "Utilizing the Scrum framework to collaborate with the team in the software development process and achieve a shared goal.",
                        "Ensure high code quality with minimal issues by adhering to coding standards and employing techniques such as test-driven development, pair programming, and others.",
                        "Refactoring the code to improve performance and reduce its size while also maintaining unit tests to ensure it remains error-free."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Associate Software Engineer",
                    "duration": "2018 - 2021",
                    "location": "Bangalore, India",
                    "description": [
                        "Took the initiative to independently develop and manage new functional modules that contributed to the growth of the company’s software.",
                        "Addressed longstanding backlog issues by rapidly coding solutions while simultaneously gaining a deeper understanding of the software's functional modules.",
                        "Became the primary point of contact for resolving issues during regression testing, thanks to my skills in developing fast, robust code."
                    ]
                },
                {
                    "company": "Electronics For Imaging",
                    "role": "Intern",
                    "duration": "01/2018 - 06/2018",
                    "location": "Bangalore, India",
                    "description": [
                        "I received training on the company's software product, its features, and its market applications.",
                        "Acquired knowledge of the new technology, Progress 4GL, which was employed in the software development process.",
                        "Proactively resolved existing software bugs during the regression cycle and gathered new requirements for early-stage development.",
                        "Excelled in the training and performed exceptionally well in developing new requirements."
                    ]
                }
            ]
        },
        "awards": {
            "title": "Honor & Awards",
            "content": [
                {
                    "title": "Best Performer of the Year",
                    "company": "eProductivity Software",
                    "year": "2023"
                },
                {
                    "title": "Best Team of the Company",
                    "company": "Electronics For Imaging",
                    "year": "2022"
                }
            ]
        },
        "education": {
            "title": "Education",
            "content": [
                {
                    "degree": "BE in Computer Science",
                    "institute": "PES Institute of Technology",
                    "duration": "2014 - 2018",
                    "location": "Bangalore, India"
                }
            ]
        }
    }
]